01-intro-to-rails/flatiron-theater-api/app/controllers/productions_controller.rb

SELECT "productions".* FROM "productions"
---
    def index
       productions = Production.all

SELECT "productions".* FROM "productions" WHERE "productions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        production = Production.find(params[:id])